# -*- coding: utf-8 -*-
from modules.Dataload import Dataload
from modules.load_picture import LoadPicture
from modules.Model import Model
from modules.preprocessing import Preprocess

# configuration
config = {
    'db_url': 'https://2ntrip.com/api/v2/usersTravelFavorite/all',
    'apis_key': 'B5nL/FhWyKccPC1MV9nglnh4vwIFjftDomXu8TOpHojhdTx9SClfnYPcJlRCVAdldpLEaVWSQHB7UVapIRLiCg==',
    'row': 5,
    'page': 1
}
area_code = {
    '서울':1,
    '인천':2,
    '대전':3,
    '대구':4,
    '광주':5,
    '부산':6,
    '울산':7,
    '세종특별자치시':8,
    '경기도':31,
    '강원도':32,
    '충청북도':33,
    '충청남도':34,
    '경상북도':35,
    '경상남도':36,
    '전라북도':37,
    '전라남도':38,
    '제주도':39
}
sigungu_code = {
    '강남구': '1', '강동구': '2', '강북구': '3', '강서구': '1', '관악구': '5', '광진구': '6', '구로구': '7', '금천구': '8', '노원구': '9', '도봉구': '10', '동대문구': '11', '동작구': '12', '마포구': '13', '서대문구': '14', '서초구': '15', '성동구': '16', '성북구': '17', '송파구': '18', '양천구': '19', '영등포구': '20', '용산구': '21', '은평구': '22', '종로구': '23', '중구': '1', '중랑구': '25', '강화군': '1', '계양구': '2', '미추홀구': '3', '남동구': '4', '동구': '3', '부평구': '6', '서구': '11', '연수구': '8', '옹진군': '9', '대덕구': '1', '유성구': '4', '남구': '2', '달서구': '2', '달성군': '3', '북구': '4', '수성구': '7', '광산구': '1', '금정구': '2', '기장군': '3', '동래구': '6', '부산진구': '7', '사상구': '9', '사하구': '10', '수영구': '12', '연제구': '13', '영도구': '14', '해운대구': '16', '울주군': '5', '세종특별자치시': '1', '가평군': '1', '고양시': '2', '과천시': '3', '광명시': '4', '광주시': '5', '구리시': '6', '군포시': '7', '김포시': '8', '남양주시': '9', '동두천시': '10', '부천시': '11', '성남시': '12', '수원시': '13', '시흥시': '14', '안산시': '15', '안성시': '16', '안양시': '17', '양주시': '18', '양평군': '19', '여주시': '20', '연천군': '21', '오산시': '22', '용인시': '23', '의왕시': '24', '의정부시': '25', '이천시': '26', '파주시': '27', '평택시': '28', '포천시': '29', '하남시': '30', '화성시': '31', '강릉시': '1', '고성군': '3', '동해시': '3', '삼척시': '4', '속초시': '5', '양구군': '6', '양양군': '7', '영월군': '8', '원주시': '9', '인제군': '10', '정선군': '11', '철원군': '12', '춘천시': '13', '태백시': '14', '평창군': '15', '홍천군': '16', '화천군': '17', '횡성군': '18', '괴산군': '1', '단양군': '2', '보은군': '3', '영동군': '4', '옥천군': '5', '음성군': '6', '제천시': '7', '진천군': '8', '청원군': '9', '청주시': '10', '충주시': '11', '증평군': '12', '공주시': '1', '금산군': '2', '논산시': '3', '당진시': '4', '보령시': '5', '부여군': '6', '서산시': '7', '서천군': '8', '아산시': '9', '예산군': '11', '천안시': '12', '청양군': '13', '태안군': '14', '홍성군': '15', '계룡시': '16', '경산시': '1', '경주시': '2', '고령군': '3', '구미시': '4', '군위군': '5', '김천시': '6', '문경시': '7', '봉화군': '8', '상주시': '9', '성주군': '10', '안동시': '11', '영덕군': '12', '영양군': '13', '영주시': '14', '영천시': '15', '예천군': '16', '울릉군': '17', '울진군': '18', '의성군': '19', '청도군': '20', '청송군': '21', '칠곡군': '22', '포항시': '23', '거제시': '1', '거창군': '2', '김해시': '4', '남해군': '5', '마산시': '6', '밀양시': '7', '사천시': '8', '산청군': '9', '양산시': '10', '의령군': '12', '진주시': '13', '진해시': '14', '창녕군': '15', '창원시': '16', '통영시': '17', '하동군': '18', '함안군': '19', '함양군': '20', '합천군': '21', '고창군': '1', '군산시': '2', '김제시': '3', '남원시': '4', '무주군': '5', '부안군': '6', '순창군': '7', '완주군': '8', '익산시': '9', '임실군': '10', '장수군': '11', '전주시': '12', '정읍시': '13', '진안군': '14', '강진군': '1', '고흥군': '2', '곡성군': '3', '광양시': '4', '구례군': '5', '나주시': '6', '담양군': '7', '목포시': '8', '무안군': '9', '보성군': '10', '순천시': '11', '신안군': '12', '여수시': '13', '영광군': '16', '영암군': '17', '완도군': '18', '장성군': '19', '장흥군': '20', '진도군': '21', '함평군': '22', '해남군': '23', '화순군': '24', '남제주군': '1', '북제주군': '2', '서귀포시': '3', '제주시': '4'
}



# 1. input: 여행지, output: 여행지 -> input 여행지와 비슷한 여행지 추천 (item_based_recommend)
# 2. input: 유저 id, output: 유저 id -> input 유저 id가 안가봤던 여행지 추천 (user_based_recommend_1)
# 3. input: 유저 id, output: 유저 id -> 전체 여행지 중 유저 취향에 맞는 여행지 추천 (user_based_recommend_2)


if __name__ == "__main__":

    # input---------------------------------------------------------------------------------------------------
    user_input = 'user_0' # 유저 아이디
    region_input = '경기도 가평군'
    recommend_type = 2
    # --------------------------------------------------------------------------------------------------------


    # Load data
    response_data = Dataload(config['db_url'])
    js_data = response_data.get_json()

    # Preporcess data
    list_data = Preprocess(js_data)
    df = list_data.make_dataset()

    # Run model
    model = Model(df)
    recommend_list = []
    picture_list = []
    if recommend_type == 1:
        for key in model.item_based_recommend(region_input):
            recommend_list.append(key)
    elif recommend_type == 2:
        for i in range(5):
            recommend_list.append(model.user_based_recommend_1(user_input)[i][0])
    elif recommend_type == 3:
        for i in range(5):
            recommend_list.append(model.user_based_recommend_2(user_input)[i][0])
    for region in recommend_list:
        area = region.split(' ')[0]
        sigungu = region.split(' ')[1]
        apis_url = 'http://apis.data.go.kr/B551011/KorService/areaBasedList?numOfRows=5&pageNo=1&MobileOS=AND&MobileApp=2ntrip&serviceKey=B5nL%2FFhWyKccPC1MV9nglnh4vwIFjftDomXu8TOpHojhdTx9SClfnYPcJlRCVAdldpLEaVWSQHB7UVapIRLiCg%3D%3D&_type=json&arrange=O&areaCode='+str(area_code[area])+'&sigunguCode='+sigungu_code[sigungu]
        load = LoadPicture(apis_url)
        picture_list.append(load.get_picture())
    
    # output--------------------------------------------------------------------------------------------------
    output = {}
    
    for region in recommend_list:
        for picture in picture_list:
            output[region] = picture
    # --------------------------------------------------------------------------------------------------------
    print(output)

